app/controllers/api/schedules_controller.rb

SELECT "schedules".* FROM "schedules" WHERE "schedules"."trucker_id" = $1 LIMIT $2  [["trucker_id", 1], ["LIMIT", 1]]
---
  def current_schedule
    schedules = Schedule.where(trucker_id: params[:id])