app/views/deliveries/new.html.erb

SELECT "orders".* FROM "orders"
---
        <tr class = "assigned_orders">
          <td> <%= o.order_id %> </td>