app/views/orders/index.html.erb

=end%>
  <%= collection_select :order, :schedule_id,  Schedule.all, :id, :schedule_name, { prompt: "Please select a Schedule" }, class: "form-control", required: true %>
---
SELECT `orders`.* FROM `orders` ORDER BY delivery_date ASC
SELECT "schedules".* FROM "schedules"