app/controllers/deliveries_controller.rb

SELECT "deliveries".* FROM "deliveries" ORDER BY "deliveries"."schedule_id" ASC
---
  def index
    @deliveries = Delivery.all.order(:schedule_id)

SELECT "deliveries".* FROM "deliveries" WHERE "deliveries"."status" = $1  [["status", "pending"]]
SELECT "orders".* FROM "orders" WHERE "orders"."status" = $1  [["status", "created"]]
SELECT "schedules".* FROM "schedules"
---
  def new

    @assigned_orders = Delivery.where(status: "pending")
    @orders = Order.where(status: "created")
    @schedules = Schedule.all

SELECT "deliveries".* FROM "deliveries" WHERE "deliveries"."schedule_id" = $1 AND "deliveries"."max" IN (SELECT MAX(sequence) FROM "deliveries")  [["schedule_id", 1]]
SELECT MAX("deliveries"."sequence") FROM "deliveries" WHERE "deliveries"."schedule_id" = $1  [["schedule_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "assigned"], ["updated_at", "2020-02-17 11:50:07.125221"], ["id", 1]]
INSERT INTO "deliveries" ("schedule_id", "order_id", "sequence", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["schedule_id", 1], ["order_id", 1], ["sequence", 1], ["status", "pending"], ["created_at", "2020-02-17 11:50:07.132474"], ["updated_at", "2020-02-17 11:50:07.132474"]]
---
  def create
    max_sequence = Delivery.where(schedule_id: params[:schedule_id]).maximum("sequence")

    if max_sequence.nil?
      max_sequence = 0
    end

    params[:order_ids].each_with_index do |order_id, index|
      Order.find(order_id).update!(status: "assigned")
      Delivery.create!(schedule_id: params[:schedule_id], order_id: order_id, status: "pending", sequence: max_sequence + index + 1)