app/controllers/deliveries_controller.rb

  def new
    @orders = Order.all
---
SELECT "orders".* FROM "orders"