app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT `orders`.* FROM `orders` ORDER BY delivery_date ASC

  def create
    @order = Order.new(order_params)
    # binding.pry
    if @order.save
---
INSERT INTO "orders" ("name", "lat", "lng", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "aff"], ["lat", 22.78], ["lng", 78.454], ["status", true], ["created_at", "2020-02-10 08:38:35.377688"], ["updated_at", "2020-02-10 08:38:35.377688"]]