app/controllers/schedules_controller.rb

SELECT "orders"."id" FROM "orders"
---
  def new
    @orders = Order.all

INSERT INTO "schedules" ("trucker_id", "delivery_date", "schedule_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["trucker_id", 1], ["delivery_date", "2020-02-07"], ["schedule_name", "1 2020-02-07"], ["created_at", "2020-02-17 07:21:37.257115"], ["updated_at", "2020-02-17 07:21:37.257115"]]
INSERT INTO "truckers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ayab"], ["created_at", "2020-02-13 06:48:16.503364"], ["updated_at", "2020-02-13 06:48:16.503364"]]
---
  def create
    # binding.pry
    # delivery = Delivery.create!(sequence: schedule_params[:order_ids])
    @schedule = Schedule.new(trucker_id: schedule_params[:trucker_id],
      delivery_date: schedule_params[:delivery_date], schedule_name: schedule_params[:trucker_id] + " on "+ schedule_params[:delivery_date])

    if @schedule.save!

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show
    @schedule = Schedule.find(params[:id])