app/controllers/truckers_controller.rb

SELECT "truckers".* FROM "truckers"
---
  def index
    @truckers = Trucker.all